apcountryman/dfp-microchip-atmega/dfp/Microchip.ATmega_DFP.pdsc
         <device Dname="ATmega64RFR2">
            <processor Dcore="AVR8" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <compile header="include/avr/iom64rfr2.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/ATmega64RFR2.atdf"/>
                  <at:variant ordercode="ATmega64RFR2-ZU" vccmin="1.8" vccmax="3.6" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="ATmega64RFR2-ZUR" vccmin="1.8" vccmax="3.6" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="ATmega64RFR2-ZF" vccmin="1.8" vccmax="3.6" tempmin="-40" tempmax="125"/>
                  <at:variant ordercode="ATmega64RFR2-ZFR" vccmin="1.8" vccmax="3.6" tempmin="-40" tempmax="125"/>
                  <at:memory start="0x0000" size="0x10000" type="flash" rw="RW" exec="1" name="FLASH" pagesize="0x100" address-space="prog"/>
                  <at:memory start="0xfc00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1" pagesize="0x100" address-space="prog"/>
                  <at:memory start="0xf800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2" pagesize="0x100" address-space="prog"/>
                  <at:memory start="0xf000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3" pagesize="0x100" address-space="prog"/>
                  <at:memory start="0xe000" size="0x2000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4" pagesize="0x100" address-space="prog"/>
                  <at:memory external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS" address-space="data"/>
                  <at:memory name="MAPPED_IO" start="0x0020" size="0x01e0" type="io" external="false" address-space="data"/>
                  <at:memory name="IRAM" start="0x0200" size="0x2000" type="ram" external="false" address-space="data"/>
                  <at:memory start="0x0000" size="0x0800" type="eeprom" rw="RW" exec="0" name="EEPROM" pagesize="0x08" address-space="eeprom"/>
                  <at:interface type="hvpp" name="HVPP"/>
                  <at:interface type="isp" name="ISP"/>
                  <at:interface type="megajtag" name="JTAG"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrone"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemkii"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="atmega64rfr2"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/ATmega64RFR2.PIC"/>
                  <mchp:xc8 name="xc8"/>
                  <mchp:hwtool type="mplab.nmmrs">
                     <mchp:file name="hwtools/mplab/avr.8bit.NMMRs.xml"/>
                     <mchp:file name="hwtools/mplab/8bit.NMMRs.xml"/>
                     <mchp:file name="hwtools/mplab/32bit.NMMRs.xml"/>
                     <mchp:file name="hwtools/mplab/arm.32bit.NMMRs.xml"/>
                     <mchp:file name="hwtools/mplab/16bit.NMMRs.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.devicesupport">
                     <mchp:file name="hwtools/mplab/mplab.deviceSupport"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="emu">
                     <mchp:file name="hwtools/emu/PK3OBDbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/Simulator.emu"/>
                     <mchp:file name="hwtools/emu/ICD4ToolBase.emu"/>
                     <mchp:file name="hwtools/emu/Snap2ToolImpl.emu"/>
                     <mchp:file name="hwtools/emu/SnapToolImpl.emu"/>
                     <mchp:file name="hwtools/emu/RI4HybridToolImpl.emu"/>
                     <mchp:file name="hwtools/emu/ICD3DbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/SKDEManager.emu"/>
                     <mchp:file name="hwtools/emu/PICkit3DbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/PKOB4ToolImpl.emu"/>
                     <mchp:file name="hwtools/emu/PICkit2DbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/AtmelIceBase.emu"/>
                     <mchp:file name="hwtools/emu/RIDbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/Pk4HybridTooImpl.emu"/>
                     <mchp:file name="hwtools/emu/PKOBSKDEDbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/AtmelIceScriptingBase.emu"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="tex">
                     <mchp:file name="hwtools/tex/PK4ToolBase.toolMediator"/>
                     <mchp:file name="hwtools/tex/PKOBSKDEDbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/RI4HybridToolImpl.toolMediator"/>
                     <mchp:file name="hwtools/tex/ICD4ToolBase.toolMediator"/>
                     <mchp:file name="hwtools/tex/RIDbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/PK3OBDbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/SKDEManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/PICkit2DbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/PICkit3DbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/Snap2ToolImpl.toolMediator"/>
                     <mchp:file name="hwtools/tex/SnapToolImpl.toolMediator"/>
                     <mchp:file name="hwtools/tex/Pk4HybridTooImpl.toolMediator"/>
                     <mchp:file name="hwtools/tex/PgmToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/AtmelIceScriptingBase.toolMediator"/>
                     <mchp:file name="hwtools/tex/ICD3DbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/PKOB4ToolImpl.toolMediator"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="pkg">
                     <mchp:file name="hwtools/pkg/pkg.pkg"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="pk4">
                     <mchp:file name="hwtools/pk4/pk4.pk4"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr.avr8">
                     <mchp:file name="hwtools/persfr/avr8.persfr"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="per">
                     <mchp:file name="hwtools/per/pic18.per"/>
                     <mchp:file name="hwtools/per/pic32.per"/>
                     <mchp:file name="hwtools/per/dspic.per"/>
                     <mchp:file name="hwtools/per/pic16.per"/>
                     <mchp:file name="hwtools/per/armcm7.per"/>
                     <mchp:file name="hwtools/per/avr8.per"/>
                     <mchp:file name="hwtools/per/pic12.per"/>
                     <mchp:file name="hwtools/per/usart.ispPeripheral.xml"/>
                     <mchp:file name="hwtools/per/usart.plibgen.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="icd4">
                     <mchp:file name="hwtools/icd4/icd4.icd4"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="ice4">
                     <mchp:file name="hwtools/ice4/ice4.ice4"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>Single-chip 8-bit Microcontroller with Low Power 2.4GHz Transceiver for IEEE 802.15.4 and ZigBee Applications with 64KB Flash and 38 I/O pins.</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATmega64RFR2" title="Device page for ATmega64RFR2"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATmega64RFR2" title="Datasheet"/>
         </device>
