apcountryman/dfp-microchip-atmega/dfp/Microchip.ATmega_DFP.pdsc
      <condition id="ATmega32U4">
         <require Dvendor="Microchip:3" Dname="ATmega32U4"/>
      </condition>
      <condition id="ATmega16M1">
         <require Dvendor="Microchip:3" Dname="ATmega16M1"/>
      </condition>
      <condition id="AT90USB646">
         <require Dvendor="Microchip:3" Dname="AT90USB646"/>
      </condition>
      <condition id="AT90USB647">
         <require Dvendor="Microchip:3" Dname="AT90USB647"/>
      </condition>
      <condition id="ATmega3290A">
         <require Dvendor="Microchip:3" Dname="ATmega3290A"/>
      </condition>
      <condition id="ATmega3208">
         <require Dvendor="Microchip:3" Dname="ATmega3208"/>
      </condition>
      <condition id="ATmega3209">
         <require Dvendor="Microchip:3" Dname="ATmega3209"/>
      </condition>
      <condition id="ATmega32HVBrevB">
         <require Dvendor="Microchip:3" Dname="ATmega32HVBrevB"/>
      </condition>
      <condition id="ATmega2561">
         <require Dvendor="Microchip:3" Dname="ATmega2561"/>
      </condition>
      <condition id="ATmega16HVBrevB">
         <require Dvendor="Microchip:3" Dname="ATmega16HVBrevB"/>
      </condition>
      <condition id="ATmega1284">
         <require Dvendor="Microchip:3" Dname="ATmega1284"/>
      </condition>
      <condition id="ATmega88">
         <require Dvendor="Microchip:3" Dname="ATmega88"/>
      </condition>
      <condition id="ATmega329P">
         <require Dvendor="Microchip:3" Dname="ATmega329P"/>
      </condition>
      <condition id="AT90CAN32">
         <require Dvendor="Microchip:3" Dname="AT90CAN32"/>
      </condition>
      <condition id="ATmega8A">
         <require Dvendor="Microchip:3" Dname="ATmega8A"/>
      </condition>
      <condition id="ATmega3290P">
         <require Dvendor="Microchip:3" Dname="ATmega3290P"/>
      </condition>
      <condition id="ATmega644PA">
         <require Dvendor="Microchip:3" Dname="ATmega644PA"/>
      </condition>
      <condition id="ATmega32U2">
         <require Dvendor="Microchip:3" Dname="ATmega32U2"/>
      </condition>
      <condition id="ATmega64">
         <require Dvendor="Microchip:3" Dname="ATmega64"/>
      </condition>
      <condition id="ATmega3290">
         <require Dvendor="Microchip:3" Dname="ATmega3290"/>
      </condition>
      <condition id="ATmega8">
         <require Dvendor="Microchip:3" Dname="ATmega8"/>
      </condition>
      <condition id="ATmega328P">
         <require Dvendor="Microchip:3" Dname="ATmega328P"/>
      </condition>
      <condition id="ATmega8515">
         <require Dvendor="Microchip:3" Dname="ATmega8515"/>
      </condition>
      <condition id="ATmega329A">
         <require Dvendor="Microchip:3" Dname="ATmega329A"/>
      </condition>
      <condition id="ATmega168">
         <require Dvendor="Microchip:3" Dname="ATmega168"/>
      </condition>
      <condition id="ATmega165A">
         <require Dvendor="Microchip:3" Dname="ATmega165A"/>
      </condition>
      <condition id="AT90CAN64">
         <require Dvendor="Microchip:3" Dname="AT90CAN64"/>
      </condition>
      <condition id="AT90USB82">
         <require Dvendor="Microchip:3" Dname="AT90USB82"/>
      </condition>
      <condition id="ATmega32M1">
         <require Dvendor="Microchip:3" Dname="ATmega32M1"/>
      </condition>
      <condition id="ATmega162">
         <require Dvendor="Microchip:3" Dname="ATmega162"/>
      </condition>
      <condition id="ATmega6450P">
         <require Dvendor="Microchip:3" Dname="ATmega6450P"/>
      </condition>
      <condition id="ATmega165P">
         <require Dvendor="Microchip:3" Dname="ATmega165P"/>
      </condition>
      <condition id="ATmega6450">
         <require Dvendor="Microchip:3" Dname="ATmega6450"/>
      </condition>
      <condition id="ATmega6450A">
         <require Dvendor="Microchip:3" Dname="ATmega6450A"/>
      </condition>
      <condition id="ATmega88A">
         <require Dvendor="Microchip:3" Dname="ATmega88A"/>
      </condition>
      <condition id="AT90PWM81">
         <require Dvendor="Microchip:3" Dname="AT90PWM81"/>
      </condition>
      <condition id="ATmega8U2">
         <require Dvendor="Microchip:3" Dname="ATmega8U2"/>
      </condition>
      <condition id="ATmega88P">
         <require Dvendor="Microchip:3" Dname="ATmega88P"/>
      </condition>
      <condition id="ATmega1284P">
         <require Dvendor="Microchip:3" Dname="ATmega1284P"/>
      </condition>
      <condition id="ATmega644P">
         <require Dvendor="Microchip:3" Dname="ATmega644P"/>
      </condition>
      <condition id="ATmega4809">
         <require Dvendor="Microchip:3" Dname="ATmega4809"/>
      </condition>
      <condition id="ATmega4808">
         <require Dvendor="Microchip:3" Dname="ATmega4808"/>
      </condition>
      <condition id="AT90PWM161">
         <require Dvendor="Microchip:3" Dname="AT90PWM161"/>
      </condition>
      <condition id="ATmega88PB">
         <require Dvendor="Microchip:3" Dname="ATmega88PB"/>
      </condition>
      <condition id="ATmega88PA">
         <require Dvendor="Microchip:3" Dname="ATmega88PA"/>
      </condition>
      <condition id="ATmega6490P">
         <require Dvendor="Microchip:3" Dname="ATmega6490P"/>
      </condition>
      <condition id="ATmega48">
         <require Dvendor="Microchip:3" Dname="ATmega48"/>
      </condition>
      <condition id="ATmega164A">
         <require Dvendor="Microchip:3" Dname="ATmega164A"/>
      </condition>
      <condition id="ATmega32HVB">
         <require Dvendor="Microchip:3" Dname="ATmega32HVB"/>
      </condition>
      <condition id="ATmega6490A">
         <require Dvendor="Microchip:3" Dname="ATmega6490A"/>
      </condition>
      <condition id="ATmega164P">
         <require Dvendor="Microchip:3" Dname="ATmega164P"/>
      </condition>
      <condition id="AT90PWM316">
         <require Dvendor="Microchip:3" Dname="AT90PWM316"/>
      </condition>
      <condition id="ATmega3250A">
         <require Dvendor="Microchip:3" Dname="ATmega3250A"/>
      </condition>
      <condition id="ATmega808">
         <require Dvendor="Microchip:3" Dname="ATmega808"/>
      </condition>
      <condition id="ATmega809">
         <require Dvendor="Microchip:3" Dname="ATmega809"/>
      </condition>
