apcountryman/dfp-microchip-atmega/dfp/Microchip.ATmega_DFP.pdsc
      <condition id="ATmega2560">
         <require Dvendor="Microchip:3" Dname="ATmega2560"/>
      </condition>
      <condition id="ATmega645A">
         <require Dvendor="Microchip:3" Dname="ATmega645A"/>
      </condition>
      <condition id="ATmega3250P">
         <require Dvendor="Microchip:3" Dname="ATmega3250P"/>
      </condition>
      <condition id="ATmega8535">
         <require Dvendor="Microchip:3" Dname="ATmega8535"/>
      </condition>
      <condition id="ATmega645P">
         <require Dvendor="Microchip:3" Dname="ATmega645P"/>
      </condition>
      <condition id="ATmega16A">
         <require Dvendor="Microchip:3" Dname="ATmega16A"/>
      </condition>
      <condition id="ATmega644RFR2">
         <require Dvendor="Microchip:3" Dname="ATmega644RFR2"/>
      </condition>
      <condition id="ATmega325A">
         <require Dvendor="Microchip:3" Dname="ATmega325A"/>
      </condition>
      <condition id="ATmega128RFA1">
         <require Dvendor="Microchip:3" Dname="ATmega128RFA1"/>
      </condition>
      <condition id="ATmega165PA">
         <require Dvendor="Microchip:3" Dname="ATmega165PA"/>
      </condition>
      <condition id="ATmega64C1">
         <require Dvendor="Microchip:3" Dname="ATmega64C1"/>
      </condition>
      <condition id="ATmega168PB">
         <require Dvendor="Microchip:3" Dname="ATmega168PB"/>
      </condition>
      <condition id="ATmega168PA">
         <require Dvendor="Microchip:3" Dname="ATmega168PA"/>
      </condition>
      <condition id="ATmega325P">
         <require Dvendor="Microchip:3" Dname="ATmega325P"/>
      </condition>
      <condition id="ATmega32">
         <require Dvendor="Microchip:3" Dname="ATmega32"/>
      </condition>
      <condition id="ATmega32C1">
         <require Dvendor="Microchip:3" Dname="ATmega32C1"/>
      </condition>
      <condition id="ATmega169PA">
         <require Dvendor="Microchip:3" Dname="ATmega169PA"/>
      </condition>
      <condition id="AT90USB1286">
         <require Dvendor="Microchip:3" Dname="AT90USB1286"/>
      </condition>
      <condition id="AT90USB1287">
         <require Dvendor="Microchip:3" Dname="AT90USB1287"/>
      </condition>
      <condition id="AT90PWM1">
         <require Dvendor="Microchip:3" Dname="AT90PWM1"/>
      </condition>
      <condition id="AT90PWM3B">
         <require Dvendor="Microchip:3" Dname="AT90PWM3B"/>
      </condition>
      <condition id="ATmega256RFR2">
         <require Dvendor="Microchip:3" Dname="ATmega256RFR2"/>
      </condition>
      <condition id="ATmega1284RFR2">
         <require Dvendor="Microchip:3" Dname="ATmega1284RFR2"/>
      </condition>
      <condition id="ATmega324A">
         <require Dvendor="Microchip:3" Dname="ATmega324A"/>
      </condition>
      <condition id="AT90USB162">
         <require Dvendor="Microchip:3" Dname="AT90USB162"/>
      </condition>
      <condition id="ATmega324P">
         <require Dvendor="Microchip:3" Dname="ATmega324P"/>
      </condition>
      <condition id="ATmega649A">
         <require Dvendor="Microchip:3" Dname="ATmega649A"/>
      </condition>
      <condition id="ATmega8HVA">
         <require Dvendor="Microchip:3" Dname="ATmega8HVA"/>
      </condition>
      <condition id="ATmega128RFR2">
         <require Dvendor="Microchip:3" Dname="ATmega128RFR2"/>
      </condition>
      <condition id="AT90PWM2B">
         <require Dvendor="Microchip:3" Dname="AT90PWM2B"/>
      </condition>
      <condition id="ATmega3250">
         <require Dvendor="Microchip:3" Dname="ATmega3250"/>
      </condition>
      <condition id="ATmega169P">
         <require Dvendor="Microchip:3" Dname="ATmega169P"/>
      </condition>
      <condition id="ATmega6490">
         <require Dvendor="Microchip:3" Dname="ATmega6490"/>
      </condition>
      <condition id="ATmega329">
         <require Dvendor="Microchip:3" Dname="ATmega329"/>
      </condition>
      <condition id="ATmega328">
         <require Dvendor="Microchip:3" Dname="ATmega328"/>
      </condition>
      <condition id="ATmega64HVE2">
         <require Dvendor="Microchip:3" Dname="ATmega64HVE2"/>
      </condition>
      <condition id="ATmega325">
         <require Dvendor="Microchip:3" Dname="ATmega325"/>
      </condition>
      <condition id="ATmega128">
         <require Dvendor="Microchip:3" Dname="ATmega128"/>
      </condition>
      <condition id="ATmega645">
         <require Dvendor="Microchip:3" Dname="ATmega645"/>
      </condition>
      <condition id="ATmega169A">
         <require Dvendor="Microchip:3" Dname="ATmega169A"/>
      </condition>
      <condition id="ATmega3290PA">
         <require Dvendor="Microchip:3" Dname="ATmega3290PA"/>
      </condition>
      <condition id="ATmega16">
         <require Dvendor="Microchip:3" Dname="ATmega16"/>
      </condition>
      <condition id="ATmega64A">
         <require Dvendor="Microchip:3" Dname="ATmega64A"/>
      </condition>
      <condition id="ATmega64M1">
         <require Dvendor="Microchip:3" Dname="ATmega64M1"/>
      </condition>
      <condition id="ATmega328PB">
         <require Dvendor="Microchip:3" Dname="ATmega328PB"/>
      </condition>
      <condition id="ATmega406">
         <require Dvendor="Microchip:3" Dname="ATmega406"/>
      </condition>
      <condition id="ATmega1608">
         <require Dvendor="Microchip:3" Dname="ATmega1608"/>
      </condition>
      <condition id="ATmega1609">
         <require Dvendor="Microchip:3" Dname="ATmega1609"/>
      </condition>
      <condition id="ATmega1280">
         <require Dvendor="Microchip:3" Dname="ATmega1280"/>
      </condition>
      <condition id="ATmega1281">
         <require Dvendor="Microchip:3" Dname="ATmega1281"/>
      </condition>
      <condition id="ATmega329PA">
         <require Dvendor="Microchip:3" Dname="ATmega329PA"/>
      </condition>
      <condition id="ATmega325PA">
         <require Dvendor="Microchip:3" Dname="ATmega325PA"/>
      </condition>
      <condition id="ATmega168P">
         <require Dvendor="Microchip:3" Dname="ATmega168P"/>
      </condition>
      <condition id="ATmega64RFR2">
         <require Dvendor="Microchip:3" Dname="ATmega64RFR2"/>
      </condition>
      <condition id="ATmega128A">
         <require Dvendor="Microchip:3" Dname="ATmega128A"/>
      </condition>
      <condition id="ATmega324PA">
         <require Dvendor="Microchip:3" Dname="ATmega324PA"/>
      </condition>
