apcountryman/dfp-microchip-atmega/dfp/Microchip.ATmega_DFP.pdsc
      <condition id="ATmega324PB">
         <require Dvendor="Microchip:3" Dname="ATmega324PB"/>
      </condition>
      <condition id="AT90CAN128">
         <require Dvendor="Microchip:3" Dname="AT90CAN128"/>
      </condition>
      <condition id="ATmega16U4">
         <require Dvendor="Microchip:3" Dname="ATmega16U4"/>
      </condition>
      <condition id="ATmega2564RFR2">
         <require Dvendor="Microchip:3" Dname="ATmega2564RFR2"/>
      </condition>
      <condition id="ATmega168A">
         <require Dvendor="Microchip:3" Dname="ATmega168A"/>
      </condition>
      <condition id="ATmega16U2">
         <require Dvendor="Microchip:3" Dname="ATmega16U2"/>
      </condition>
      <condition id="ATmega644A">
         <require Dvendor="Microchip:3" Dname="ATmega644A"/>
      </condition>
      <condition id="AT90PWM216">
         <require Dvendor="Microchip:3" Dname="AT90PWM216"/>
      </condition>
      <condition id="ATmega164PA">
         <require Dvendor="Microchip:3" Dname="ATmega164PA"/>
      </condition>
      <condition id="ATmega649">
         <require Dvendor="Microchip:3" Dname="ATmega649"/>
      </condition>
      <condition id="ATmega649P">
         <require Dvendor="Microchip:3" Dname="ATmega649P"/>
      </condition>
      <condition id="ATmega640">
         <require Dvendor="Microchip:3" Dname="ATmega640"/>
      </condition>
      <condition id="ATmega644">
         <require Dvendor="Microchip:3" Dname="ATmega644"/>
      </condition>
      <condition id="ATmega48PB">
         <require Dvendor="Microchip:3" Dname="ATmega48PB"/>
      </condition>
      <condition id="ATmega48PA">
         <require Dvendor="Microchip:3" Dname="ATmega48PA"/>
      </condition>
      <condition id="ATmega48A">
         <require Dvendor="Microchip:3" Dname="ATmega48A"/>
      </condition>
      <condition id="ATmega16HVA">
         <require Dvendor="Microchip:3" Dname="ATmega16HVA"/>
      </condition>
      <condition id="ATmega16HVB">
         <require Dvendor="Microchip:3" Dname="ATmega16HVB"/>
      </condition>
      <condition id="ATmega48P">
         <require Dvendor="Microchip:3" Dname="ATmega48P"/>
      </condition>
      <condition id="ATmega3250PA">
         <require Dvendor="Microchip:3" Dname="ATmega3250PA"/>
      </condition>
      <condition id="ATmega32A">
         <require Dvendor="Microchip:3" Dname="ATmega32A"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.3.0" condition="ATmega32U4">
         <description>Headers and startup code for Microchip ATmega32U4</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/avr/iom32u4.h"/>
            <file condition="XC" category="header" name="xc8/avr/include/avr/iom32u4.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC" category="libraryPrefix" name="gcc/dev/atmega32u4"/>
            <file condition="AVRASM" category="include" name="avrasm/inc"/>
            <file condition="AVRASM" category="header" name="avrasm/inc/m32U4def.inc"/>
            <file condition="AVRASM" category="source" name="avrasm/templates/main.asm" attr="template" select="Main file (.asm)"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.3.0" condition="ATmega16M1">
         <description>Headers and startup code for Microchip ATmega16M1</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/avr/iom16m1.h"/>
            <file condition="XC" category="header" name="xc8/avr/include/avr/iom16m1.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC" category="libraryPrefix" name="gcc/dev/atmega16m1"/>
            <file condition="AVRASM" category="include" name="avrasm/inc"/>
            <file condition="AVRASM" category="header" name="avrasm/inc/m16M1def.inc"/>
            <file condition="AVRASM" category="source" name="avrasm/templates/main.asm" attr="template" select="Main file (.asm)"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.3.0" condition="AT90USB646">
         <description>Headers and startup code for Microchip AT90USB646</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/avr/iousb646.h"/>
            <file condition="XC" category="header" name="xc8/avr/include/avr/iousb646.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC" category="libraryPrefix" name="gcc/dev/at90usb646"/>
            <file condition="AVRASM" category="include" name="avrasm/inc"/>
            <file condition="AVRASM" category="header" name="avrasm/inc/usb646def.inc"/>
            <file condition="AVRASM" category="source" name="avrasm/templates/main.asm" attr="template" select="Main file (.asm)"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.3.0" condition="AT90USB647">
         <description>Headers and startup code for Microchip AT90USB647</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/avr/iousb647.h"/>
            <file condition="XC" category="header" name="xc8/avr/include/avr/iousb647.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC" category="libraryPrefix" name="gcc/dev/at90usb647"/>
            <file condition="AVRASM" category="include" name="avrasm/inc"/>
            <file condition="AVRASM" category="header" name="avrasm/inc/usb647def.inc"/>
            <file condition="AVRASM" category="source" name="avrasm/templates/main.asm" attr="template" select="Main file (.asm)"/>
         </files>
      </component>
